Repository: paulonz/Nz.Framework
Catalog: Src/Core/Model/Nz.Core.Model/Validations.*.resx
Languages: pt

# ArgumentException_Invalid_offset_and_size
source: Invalid offset and size.
pt: Offset e size inválidos.

# ArgumentException_Invalid_reserve_capacity
source: Invalid reserve capacity.
pt: Capacidade de reserva inválida.

# ArgumentIsNullOrWhitespace
source: The parameter '{0}' cannot be null or blank.
pt: O parâmetro '{0}' não pode ser null ou em branco.

# AssociatedMetadataTypeTypeDescriptor_MetadataTypeContainsUnknownProperties
source: The type of metadata associated with type '{0}' contains the following unknown properties or fields: {1}. Make sure that the names of these members match the names of the properties in the main type.
pt: O tipo de metadados associado ao tipo '{0}' contém as seguintes propriedades ou campos desconhecidos: {1}. Verifique se os nomes desses membros correspondem aos nomes das propriedades no tipo principal.

# AttributeStore_Type_Must_Be_Public
source: The type '{0}' must be public.
pt: O tipo '{0}' deve ser público.

# AttributeStore_Unknown_Method
source: The type '{0}' does not have a public method called '{1}'.
pt: O tipo '{0}' não possui um método público chamado '{1}'.

# AttributeStore_Unknown_Property
source: Type '{0}' does not have a public property called '{1}'.
pt: O tipo '{0}' não possui uma propriedade pública chamada '{1}'.

# CompareAttribute_MustMatch
source: '{0}' and '{1}' do not match.
pt: '{0}' e '{1}' não combinam.

# CompareAttribute_UnknownProperty
source: The property {0} was not found.
pt: Não foi encontrada a propriedade {0}.

# CreditCardAttribute_Invalid
source: The {0} field is not a valid credit card number.
pt: O campo {0} não é um número válido de cartão de crédito.

# CustomValidationAttribute_Method_Must_Return_ValidationResult
source: The '{0}' method of type CustomValidationAttribute in type '{1}' must return System.ComponentModel.DataAnnotations.ValidationResult. Use System.ComponentModel.DataAnnotations.ValidationResult.Success to represent success.
pt: O método '{0}' do tipo CustomValidationAttribute no tipo '{1}' deve retornar System.ComponentModel.DataAnnotations.ValidationResult. Use System.ComponentModel.DataAnnotations.ValidationResult.Success para representar sucesso.

# CustomValidationAttribute_Method_Not_Found
source: The '{0}' method of type CustomValidationAttribute does not exist in type '{1}' or is not public or static.
pt: O método '{0}' do tipo CustomValidationAttribute não existe no tipo '{1}' ou não é público ou estático.

# CustomValidationAttribute_Method_Required
source: CustomValidationAttribute.Method has not been defined.
pt: O CustomValidationAttribute.Method não foi definido.

# CustomValidationAttribute_Method_Signature
source: The '{1}' method of type CustomValidationAttribute in type '{1}' must have the signature: public static ValidationResult {0} (object value, ValidationContext context). The value must be a concrete type. The ValidationContext parameter is optional.
pt: O método '{1}' do tipo CustomValidationAttribute no tipo '{1}' deve ter a assinatura: public static ValidationResult {0}(object value, ValidationContext context). O valor deve ser um tipo concreto. O parâmetro ValidationContext é opcional.

# CustomValidationAttribute_Type_Conversion_Failed
source: It was not possible to convert the value of type '{0}' to '{1}' as expected by method {2}. {3}.
pt: Não foi possível converter o valor do tipo '{0}' para '{1}' como esperado pelo método {2}.{3}.

# CustomValidationAttribute_Type_Must_Be_Public
source: Custom validation type '{0}' must be public.
pt: Tipo de validação personalizado '{0}' deve ser público.

# CustomValidationAttribute_ValidationError
source: {0} invalid.
pt: {0} inválido(a).

# CustomValidationAttribute_ValidatorType_Required
source: CustomValidationAttribute.ValidatorType not informed.
pt: CustomValidationAttribute.ValidatorType não informado.

# DataTypeAttribute_EmptyDataTypeString
source: The DataType value cannot be null or empty.
pt: O valor de DataType não pode ser nulo em vazio.

# DataTypeAttribute_InvalidCurrentyValue
source: Invalid value for '{0}'.
pt: Valor inválido para '{0}'.

# DateGreaterThan_ValidationError
source: The date {0} must be greater than {1}
pt: A data {0} deve ser maior que {1}

# DisplayAttribute_PropertyNotSet
source: The {0} property has not been set. Use the {1} method to retrieve the value.
pt: A propriedade {0} não foi definida. Use o método {1} para recuperar o valor.

# EmailAddressAttribute_Invalid
source: The field {0} does not have a valid email.
pt: O campo {0} não possui um email válido.

# EnumDataTypeAttribute_TypeCannotBeNull
source: EnumDataTypeAttribute cannot be null.
pt: EnumDataTypeAttribute não pode ser nulo.

# EnumDataTypeAttribute_TypeNeedsToBeAnEnum
source: The type '{0}' must be an enum.
pt: O tipo '{0}' deve ser um enum.

# FileExtensionsAttribute_Invalid
source: The {0} field accepts only files with the extensions: {1}
pt: O campo {0} aceita apenas arquivos com as extensões: {1}

# LocalizableString_LocalizationFailed
source: The property '{0}' was not recovered due to localization failure. The type '{1}' is not public or does not contain a public static string property with the name '{2}'.
pt: A propriedade não foi recuperada '{0}' por falha na localization. O tipo '{1}' não é público ou não contém uma propriedade public static string com o nome '{2}'.

# MaxLengthAttribute_InvalidMaxLength
source: The Length value of MaxLengthAttribute must be greater than zero. Use MaxLength () without parameters to indicate that this string or array can be the maximum size allowed.
pt: O valor Length de MaxLengthAttribute de ser maior que zero. Use MaxLength() sem parâmetros para indicar que essa string ou array pode ter o tamanho máximo permitido.

# MaxLengthAttribute_ValidationError
source: The {0} field must be a string or array with a maximum size of '{1}'.
pt: O campo {0} deve ser uma string ou array com tamanho máximo de '{1}'.

# MetadataTypeAttribute_TypeCannotBeNull
source: MetadataClassType cannot be null.
pt: MetadataClassType não pode ser null.

# MinLengthAttribute_InvalidMinLength
source: The Length value of MinLengthAttribute must be greater than or equal to zero.
pt: O valor Length de MinLengthAttribute deve maior ou igual a zero.

# MinLengthAttribute_ValidationError
source: The {0} field must be a string or array with a minimum size of '{1}'.
pt: O campo {0} deve ser uma string ou array com o tamanho minimo de '{1}'.

# PhoneAttribute_Invalid
source: The {0} field does not have a valid phone.
pt: O campo {0} não possui um telefone válido.

# RangeAttribute_ArbitraryTypeNotIComparable
source: The type {0} must implement {1}.
pt: O tipo {0} deve implementar {1}.

# RangeAttribute_MinGreaterThanMax
source: The maximum value '{0}' must be greater than or equal to the minimum value '{1}'.
pt: O valor máximo '{0}' deve ser maior ou igual ao valor mínimo '{1}'.

# RangeAttribute_Must_Set_Min_And_Max
source: The minimum and maximum values ​​must be informed.
pt: Os valores mínimo e máximo devem ser informados.

# RangeAttribute_Must_Set_Operand_Type
source: The OperandType must be informed when the minimum and maximum values ​​are strings.
pt: O OperandType deve ser informado quando o valor mínimo e máximo forem strings.

# RangeAttribute_ValidationError
source: The value of the {0} field must be between {1} and {2}.
pt: O valor do campo {0} deve estar entre {1} e {2}.

# RegexAttribute_ValidationError
source: The value of the field {0} must satisfy the regular expression '{1}'.
pt: O valor do campo {0} deve satisfazer a expressão regular '{1}'.

# RegularExpressionAttribute_Empty_Pattern
source: The pattern must be a valid regular expression.
pt: O pattern deve ser uma expressão regular válida.

# RequiredAttribute_ValidationError
source: The {0} field is mandatory.
pt: O campo {0} é obrigatório.

# StringLengthAttribute_InvalidMaxLength
source: Maximum size must be a positive integer
pt: O tamanho máximo deve ser um inteiro positivo

# StringLengthAttribute_ValidationError
source: The value of the {0} field must be a string with a maximum length of {1}.
pt: O valor do campo {0} deve ser uma string com tamanho máximo de {1}.

# StringLengthAttribute_ValidationErrorIncludingMinimum
source: The {0} field must be a text with a minimum of {2} and a maximum of {1} characters.
pt: O campo {0} deve ser um texto com no mínimo {2} e no máximo {1} caracteres.

# UrlAttribute_Invalid
source: The {0} field value is not a valid http, https, or ftp URL.
pt: O valor do campo {0} não é uma URL http, https, ou ftp válida.

# ValidationAttribute_Cannot_Set_ErrorMessage_And_Resource
source: The value of ErrorMessageString or ErrorMessageResourceName must be defined, but not both.
pt: O valor de ErrorMessageString ou ErrorMessageResourceName deve ser definido, mas não os dois.

# ValidationAttribute_IsValid_NotImplemented
source: IsValid (object value) was not implemented in this class. The preferred method is GetValidationResult () and the class must override IsValid (object value, ValidationContext context).
pt: IsValid(object value) não foi implemetado nessa classe. O método preferencial é GetValidationResult() e a classe deve sobreescrever IsValid(object value, ValidationContext context).

# ValidationAttribute_NeedBothResourceTypeAndResourceName
source: Both ErrorMessageResourceType and ErrorMessageResourceName must be entered in this attribute.
pt: Tanto ErrorMessageResourceType como ErrorMessageResourceName devem ser informados nesse atributo.

# ValidationAttribute_ResourcePropertyNotStringType
source: The property '{0}' in the resource of type '{1}' is not a string.
pt: A propriedade '{0}' no resource do tipo '{1}' não é uma string.

# ValidationAttribute_ResourceTypeDoesNotHaveProperty
source: The resource of type '{0}' does not have a static property with the name '{1}'.
pt: O resource do tipo '{0}' não possui uma propriedade statica com o nome '{1}'.

# ValidationAttribute_ValidationError
source: The {0} field value is invalid.
pt: O valor do campo {0} é inválido.

# ValidationContextServiceContainer_ItemAlreadyExists
source: A service of type '{0}' already exists in the container.
pt: Um serviço do tipo '{0}' já existe no container.

# ValidationContext_Must_Be_Method
source: ValidationContext for type '{0}', member '{1}' must have MethodInfo.
pt: O ValidationContext para o tipo '{0}', membro '{1}' deve possuir MethodInfo.

# Validator_InstanceMustMatchValidationContextInstance
source: The supplied instance must be of type ObjectInstance in the supplied ValidationContext.
pt: A instância fornecida deve ser do tipo ObjectInstance no ValidationContext fornecido.

# Validator_Property_Value_Wrong_Type
source: The value of the property '{0}' must be of type '{1}'.
pt: O valor da propriedade '{0}' deve ser do tipo '{1}'.
